НВ_Доработки/Documents/ЗаявкаНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаявкаНаДоставку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НВД_КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплачиваетПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВодительЗаберетГрузСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявокНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтветственныйЗаДоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЗатратНаДоставку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/Documents/ЗаявкаНаДоставку/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НВД_НВД_КонтактноеЛицоНачалоВыбораПосле(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НВД_ОбщегоназначенияТиповыеКлиент.НВД_НачалоВыбораКонтактногоЛицаКонтрагента(Элемент, СтандартнаяОбработка,
		Объект.Получатель);
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаСобытияАдресПриИзменении")
Процедура НВД_ОбработкаСобытияАдресПриИзменении(Адрес)

	Если ПустаяСтрока(Адрес) Тогда
		Объект.ИдентификаторУлицы = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	#Вставка	
	Иначе
		ОпределитьАдресПоЯндексу(Объект.Город, Объект.АдресДоставки);
	#КонецВставки	
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОпределитьАдресПоЯндексу(ОбъектГород, ОбъектАдрес)
	
	Запрос = Новый HTTPСоединение("geocode-maps.yandex.ru", , , , , , Новый ЗащищенноеСоединениеOpenSSL());
	АдресOutput = КаталогВременныхФайлов() + "geores.xml";	
	Запрос.Получить("/1.x/?apikey=5c2df4f3-48d0-4d23-94d5-13306fe8d024&geocode=" + ОбъектАдрес + "&ll=37.618920,55.756994&spn=3.552069,2.400552", АдресOutput);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(АдресOutput);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументДОМ = ПостроительDOM.Прочитать(ЧтениеXML);	
	ЧтениеXML.Закрыть();	
	Найдено = ДокументДОМ.ПолучитьЭлементыПоИмени("featureMember");
	
	НайденныеАдреса = Новый СписокЗначений;
	

	
	Для каждого НайденныйАдрес из Найдено Цикл		
		//НовыйАдрес = НайденныеАдреса.Добавить();		
		//АдресИсправленный = ОбъектАдрес;		
		//СписокTextАдрес = НайденныйАдрес.ПолучитьЭлементыПоИмени("AddressLine");	
		//Если СписокTextАдрес.Количество()>0 Тогда
		//	АдресИсправленный = СписокTextАдрес[0].ТекстовоеСодержимое; //Адрес, исправленный Яндексом
		//КонецЕсли;		
		//НовыйАдрес.Значение = АдресИсправленный;
		
		НовыйАдрес = Новый Структура("АдресИсправленный, Страна, Регион, Округ, НаселенныйПункт, Улица, Дом");
		
		СписокTextСтрана = НайденныйАдрес.ПолучитьЭлементыПоИмени("CountryName");	
		
		Если СписокTextСтрана.Количество() > 0 Тогда
			Страна = СписокTextСтрана[0].ТекстовоеСодержимое;
			НовыйАдрес.Страна = Страна;
		КонецЕсли;
		
		АдресИсправленный=ОбъектАдрес;
		СписокTextАдрес = НайденныйАдрес.ПолучитьЭлементыПоИмени("AddressLine");	
		Если СписокTextАдрес.Количество() > 0 Тогда
			АдресИсправленный = СписокTextАдрес[0].ТекстовоеСодержимое; //Адрес, исправленный Яндексом
		КонецЕсли;
		НовыйАдрес.АдресИсправленный = АдресИсправленный;
		
		СписокTextРегион = НайденныйАдрес.ПолучитьЭлементыПоИмени("AdministrativeAreaName");	
		Если СписокTextРегион.Количество() > 0 Тогда
			Регион = СписокTextРегион[0].ТекстовоеСодержимое;
			НовыйАдрес.Регион = Регион;
		КонецЕсли;
		
		СписокTextОкруг = НайденныйАдрес.ПолучитьЭлементыПоИмени("SubAdministrativeAreaName");	
		Если СписокTextОкруг.Количество()>0 Тогда
			Округ=СписокTextОкруг[0].ТекстовоеСодержимое;
			НовыйАдрес.Округ=Округ;
		КонецЕсли;	
		
		СписокTextНаселенныйПункт = НайденныйАдрес.ПолучитьЭлементыПоИмени("LocalityName");	
		Если СписокTextНаселенныйПункт.Количество()>0 Тогда
			НаселенныйПункт=СписокTextНаселенныйПункт[0].ТекстовоеСодержимое;
			НовыйАдрес.НаселенныйПункт=НаселенныйПункт;
		КонецЕсли;	
		
		СписокTextУлица = НайденныйАдрес.ПолучитьЭлементыПоИмени("ThoroughfareName");	
		Если СписокTextУлица.Количество()>0 Тогда
			Улица=СписокTextУлица[0].ТекстовоеСодержимое;
			НовыйАдрес.Улица=Улица;
		КонецЕсли;	
		
		СписокTextДом = НайденныйАдрес.ПолучитьЭлементыПоИмени("PremiseNumber");	
		Если СписокTextДом.Количество()>0 Тогда
			Дом = СписокTextДом[0].ТекстовоеСодержимое;
			НовыйАдрес.Дом = Дом;
		КонецЕсли;
		НайденныеАдреса.Добавить(НовыйАдрес, НовыйАдрес.АдресИсправленный);
	КонецЦикла;
	
	Если НайденныеАдреса.Количество() = 1 Тогда
		ОбъектГород = НайтиГородПоНаименованию(НайденныеАдреса[0].Значение.НаселенныйПункт, НайденныеАдреса[0].Значение.Округ);
		ОбъектАдрес = АдресИсправленныйБезСтраны(НайденныеАдреса[0].Значение.АдресИсправленный);
	ИначеЕсли НайденныеАдреса.Количество() > 1 Тогда
		Рез = НайденныеАдреса.ВыбратьЭлемент("Выберите адрес:");
		Если Рез <> Неопределено Тогда
			ОбъектГород = НайтиГородПоНаименованию(Рез.Значение.НаселенныйПункт, Рез.Значение.Округ);
			ОбъектАдрес = АдресИсправленныйБезСтраны(Рез.Значение.АдресИсправленный);
		Иначе
			ОбъектГород = "";
			ОбъектАдрес = "";	
		КонецЕсли;
	ИначеЕсли НайденныеАдреса.Количество() = 0 Тогда
		ОбъектГород = "";
	    ОбъектАдрес = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АдресИсправленныйБезСтраны(АдресИсправленный)
	
	Возврат СтрЗаменить(АдресИсправленный, "Россия, ", "");
	
КонецФункции	

&НаСервере
Функция НайтиГородПоНаименованию(ГородНаименование, ОкругНаименование = Неопределено, РегионНаименование = Неопределено)
	
	МассивГородов = ОбщийМодульСервер.ПолучитьПредставленияНаселенныхПунктовПоНаименованию(ГородНаименование);
	Если МассивГородов = Неопределено ИЛИ МассивГородов.Количество() = 0 Тогда
		МассивГородов = ОбщийМодульСервер.ПолучитьПредставленияНаселенныхПунктовПоНаименованию(ОкругНаименование);
	КонецЕсли;
	Если МассивГородов = Неопределено ИЛИ МассивГородов.Количество() = 0 Тогда
		МассивГородов = ОбщийМодульСервер.ПолучитьПредставленияНаселенныхПунктовПоНаименованию(РегионНаименование);
	КонецЕсли;
	Если МассивГородов = Неопределено ИЛИ МассивГородов.Количество() = 0 Тогда	
		Возврат Справочники.Города.ПустаяСсылка();
	Иначе
		Если МассивГородов.Количество() > 1 Тогда
			А = МассивГородов.Количество() - 1;
			Пока МассивГородов.Количество() <> 1 Цикл
				МассивГородов.Удалить(А);
				А = А - 1;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
			
	Возврат ДобавитьИзКлассификатора(ГородНаименование, МассивГородов, Истина, Истина);
	
КонецФункции

&НаСервере
Функция СформироватьСтрокуАдреса(Регион, Округ, Город, Улица, Дом)
	СтрокаАдреса = "";
	Если ЗначениеЗаполнено(Регион) Тогда
		СтрокаАдреса = Регион;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Округ) Тогда
		Если ЗначениеЗаполнено(СтрокаАдреса) Тогда
			СтрокаАдреса = СтрокаАдреса + ", " + Округ;
		Иначе
			СтрокаАдреса = Округ;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Город) Тогда
		Если ЗначениеЗаполнено(СтрокаАдреса) Тогда
			СтрокаАдреса = СтрокаАдреса + ", " + Город;
		Иначе
			СтрокаАдреса = Город;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Улица) Тогда
		Если ЗначениеЗаполнено(СтрокаАдреса) Тогда
			СтрокаАдреса = СтрокаАдреса + ", " + Улица;
		Иначе
			СтрокаАдреса = Улица;
		КонецЕсли;	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Дом) Тогда
		Если ЗначениеЗаполнено(СтрокаАдреса) Тогда
			СтрокаАдреса = СтрокаАдреса + ", " + Дом;
		Иначе
			СтрокаАдреса = Дом;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат СтрокаАдреса;
КонецФункции

Функция ДобавитьИзКлассификатора(ГородНаименование, МассивГородов, ИспользуетсяВРознице, ИспользуетсяВПроизводстве) Экспорт
	
	Для каждого ЭлементГорода из МассивГородов Цикл
		НайденныйГород = Справочники.Города.НайтиПоНаименованию(ГородНаименование, Истина);
		Если НЕ ЗначениеЗаполнено(НайденныйГород) Тогда
			СпрОбъект = Справочники.Города.СоздатьЭлемент();
			СпрОбъект.Наименование = ГородНаименование;
			СпрОбъект.КодКЛАДР = ЭлементГорода.КодКЛАДР;
			СпрОбъект.ИспользуетсяВРознице = ИспользуетсяВРознице;
			СпрОбъект.ИспользуетсяВПроизводстве = ИспользуетсяВПроизводстве;
			СпрОбъект.Записать();

			НайденныйГород = СпрОбъект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденныйГород;

КонецФункции


&НаКлиенте
Процедура НВД_ПередЗаписьюВместо(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.Получатель.Пустая()
		И АдресДоставкиБылИзменен // №11868
		И НЕ АдресИмеетсяВКарточкеПолучателя() Тогда
		
		ПослеВопросаОДобавленииАдресаВКарточкуПолучателя = Новый ОписаниеОповещения("ПослеВопросаОДобавленииАдресаВКарточкуПолучателя", ЭтаФорма);
		ПоказатьВопрос(ПослеВопросаОДобавленииАдресаВКарточкуПолучателя, "Указанный в документе адрес отсутствует в карточке получателя. Добавить адрес в карточку?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Если НужноОтправитьУведомлениеEMail() Тогда
		Объект.ОтправленEMail = Истина;
		
		ПисьмоСНакладной = Ложь;
		Если Вопрос("Вложить печатную форму накладной в электронное письмо?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПисьмоСНакладной = Истина;
		КонецЕсли;
		
		СсылкаНаЭлектронноеПисьмо = СформироватьЭлектронноеПисьмо(ПисьмоСНакладной);
		
		Парам = Новый Структура("Ключ",СсылкаНаЭлектронноеПисьмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",Парам);
	КонецЕсли;
	
	Если НужноОтправитьУведомлениеСМС() Тогда
		Если ОбщийМодульВызовСервера.ЕстьТелефонКонтрагента(Объект.Получатель) Тогда	
			Парам = Новый Структура;
			Парам.Вставить("Основание", Объект.Ссылка);
			ОткрытьФорму("Документ.ОтправкаСМС.Форма.ФормаДокумента",Парам,,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыНовогоСМС",ЭтаФорма));		
		Иначе
			ПоказатьОповещениеПользователя("У контрагента в карточке не указан номер телефона. СМС не создана");
		КонецЕсли;

	КонецЕсли;
	
	ОбновитьИзображениеКомандОтправкиСообщений();
	
	АдресДоставкиБылИзменен = Ложь; // №11868
	
	//nva+++
	ТекстОшибки = "";
	
	Если НЕ ЗначениеЗаполнено(Объект.ОжидаемаяДатаДоставки) Тогда
		Поле = "ОжидаемаяДатаДоставки";
		ТекстОшибки = "Не заполнена Планируемая дата доставки";
	Иначе
		Если Объект.ОжидаемаяДатаДоставки <= Объект.ОжидаемаяДатаОтправки Тогда
			Поле = "ОжидаемаяДатаДоставки";
			ТекстОшибки = "Планируемая дата доставки не может быть меньше или равной Планируемой даты отправки";
		КонецЕсли;
	КонецЕсли; 
	
	//Если НЕ ЗначениеЗаполнено(ТекстОшибки) И НЕ ЗначениеЗаполнено(Объект.НВД_КонтактноеЛицо) Тогда
	//	Поле = "НВД_КонтактноеЛицо";
	//	ТекстОшибки = "Заполните ""Контактное лицо""";
	//КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ТекстОшибки;
		СообщениеПользователю.Поле= Поле;
		СообщениеПользователю.ПутьКДанным = "Объект";
		СообщениеПользователю.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если СпособоДоставкиЭтоСобственныйТранспорт() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
			Поле = "ТранспортноеСредство";
			ТекстОшибки = НСтр("ru='Если доставка осуществляется собственным транспортом, то заполнение транспортного средства обязательно'");	
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ТекстОшибки;
			СообщениеПользователю.Поле= Поле;
			СообщениеПользователю.ПутьКДанным = "Объект";
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если СтатусОтправленоИлиДоставлено() Тогда
		Если (Объект.СтоимостьДоставки + Объект.СтоимостьДоставки*0.2 <= Объект.СуммаЗатратНаДоставку) И СтрДлина(Объект.Комментарий) <= 10 Тогда
			Поле = "СуммаЗатратНаДоставку"; 
			ТекстОшибки = НСтр("ru='Если стомость доставки отличается от суммы оплаты компанией, то заполнение комментария обязательно'");	
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ТекстОшибки;
			СообщениеПользователю.Поле= Поле;
			СообщениеПользователю.ПутьКДанным = "Объект";
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//nva---
КонецПроцедуры 

//nva+++
&НаСервере
Функция СпособоДоставкиЭтоСобственныйТранспорт()
	Возврат Объект.СпособДоставки = Справочники.СпособыДоставкиТовара.СобственныйТранспорт;
КонецФункции

&НаСервере
Функция СтатусОтправленоИлиДоставлено()
	Возврат Объект.Результат = Справочники.СтатусыЗаявокНаДоставку.Отправлено ИЛИ Объект.Результат = Справочники.СтатусыЗаявокНаДоставку.Доставлено;
КонецФункции	
//nva---

&НаСервере
Процедура НВД_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ОжидаемаяДатаДоставки = Объект.ОжидаемаяДатаОтправки + 60*60; //nva добавим час
		Объект.СпособДоставки = Справочники.СпособыДоставкиТовара.Такси;
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
КонецПроцедуры


&НаКлиенте
Процедура НВД_ТелефонКонтактногоЛицаПриИзмененииПосле(Элемент)
	
	//ТелефонПоМаске = Лев(ТелефонКонтактногоЛица, 18);
	//НаименованиеКонтактногоЛица = СокрЛП(Сред(ТелефонКонтактногоЛица, СтрНайти(ТелефонКонтактногоЛица, ТелефонПоМаске) + СтрДлина(ТелефонПоМаске), СтрДлина(ТелефонКонтактногоЛица) - СтрДлина(ТелефонПоМаске))); 
	//ТелефонТолькоЦифры = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ТелефонПоМаске, " ", ""), "-", ""), "+7", ""), "(", ""), ")", "");
	//Если СтрДлина(ТелефонТолькоЦифры) = 10 Тогда
	//	Объект.НВД_КонтактноеЛицо = ПолучитьКонтактноеЛицо(ТелефонТолькоЦифры, НаименованиеКонтактногоЛица); 
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтактноеЛицо(Телефон, Наименование)
	
	КонтактноеЛицоСсылка = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
		|		ПО (КонтактныеЛицаКонтактнаяИнформация.Ссылка = КонтактныеЛица.Ссылка)
		|ГДЕ
		|	(СТРНАЙТИ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(КонтактныеЛицаКонтактнаяИнформация.НомерТелефона, ""+7"", """"), "" "", """"), ""-"", """"), ""("", """"), "")"", """"), &НомерТелефона) > 0
		|			ИЛИ СТРНАЙТИ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(КонтактныеЛицаКонтактнаяИнформация.Представление, ""+7"", """"), "" "", """"), ""-"", """"), ""("", """"), "")"", """"), &НомерТелефона) > 0
		|			ИЛИ СТРНАЙТИ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(КонтактныеЛицаКонтактнаяИнформация.Значение, ""+7"", """"), "" "", """"), ""-"", """"), ""("", """"), "")"", """"), &НомерТелефона) > 0)
		|	И КонтактныеЛица.ОбъектВладелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Получатель);
	Запрос.УстановитьПараметр("НомерТелефона", Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		КонтактноеЛицоСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактноеЛицоСсылка) Тогда
		Возврат КонтактноеЛицоСсылка;
	КонецЕсли;
	
	КонтактноеЛицоОбъект = Справочники.КонтактныеЛица.СоздатьЭлемент();
	КонтактноеЛицоОбъект.ОбъектВладелец = Объект.Получатель;
	КонтактноеЛицоОбъект.Наименование = ?(ЗначениеЗаполнено(Наименование), Наименование, Лев(ТелефонКонтактногоЛица, 18));
	КИСтрока = КонтактноеЛицоОбъект.КонтактнаяИнформация.Добавить();
	КИСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	КИСтрока.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
	КИСтрока.НомерТелефона = "+7" + Телефон;
	КИСтрока.Представление = "+7" + Телефон;
	КонтактноеЛицоОбъект.Записать();
	
	Возврат КонтактноеЛицоОбъект.Ссылка;
		
КонецФункции
